pkwasniok/avr-db-template/lib/atpack/edc/AVR64DU32.PIC
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS0OUTSET" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xC41">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS0INCLR" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xC42">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS0INSET" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xC43">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x3C" edc:_addr="0xC44"/>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS1OUTCLR" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xC80">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS1OUTSET" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xC81">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS1INCLR" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xC82">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS1INSET" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xC83">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x3C" edc:_addr="0xC84"/>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS2OUTCLR" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xCC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS2OUTSET" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xCC1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS2INCLR" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xCC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS2INSET" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xCC3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x3C" edc:_addr="0xCC4"/>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS3OUTCLR" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xD00">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS3OUTSET" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xD01">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS3INCLR" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xD02">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS3INSET" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xD03">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x3C" edc:_addr="0xD04"/>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS4OUTCLR" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xD40">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS4OUTSET" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xD41">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS4INCLR" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xD42">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
